Домашняя_работа/src/DataProcessors/РасчетПремий/РасчетПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>РасчетПремий</name>
</mdclass:DataProcessor>

Домашняя_работа/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Домашняя_работа/src/Enums/ТипНоменклатуры/ТипНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипНоменклатуры</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

Домашняя_работа/src/DataProcessors/РасчетПремий/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПоказатьПодробныйРасчет(Команда)
	ПоказатьПодробныйРасчет = Не ПоказатьПодробныйРасчет;
	Если ПоказатьПодробныйРасчет Тогда
		Элементы.ТаблицаПремииПоказатьПодробныйРасчет.Заголовок = "Скрыть подробный отчет";
		Элементы.ТаблицаПремииТовары.Видимость = Истина;
		Элементы.ТаблицаПремииУслуги.Видимость = Истина;
	Иначе
		Элементы.ТаблицаПремииПоказатьПодробныйРасчет.Заголовок = "Показать подробный отчет";
		Элементы.ТаблицаПремииТовары.Видимость = Ложь;
		Элементы.ТаблицаПремииУслуги.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура Рассчитать(Команда)
	ТаблицаПремии.Очистить();
	Если ПроверитьЗаполнение() Тогда
		РассчитатьНаСервере();
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	
	ТипТовар = Перечисления.ТипНоменклатуры.Товар;
	ТипУслуга = Перечисления.ТипНоменклатуры.Услуга;
	
	Обороты = РегистрыНакопления.Продажи.Обороты(Период.ДатаНачала, Период.ДатаОкончания);
	
	Для Каждого Строка Из Обороты Цикл
		СтрокаТаблицаПремия = ТаблицаПремии.Добавить();
		СтрокаТаблицаПремия.Сотрудник = Строка.Сотрудник;
		Если Строка.Номенклатура.ТипНоменклатуры = ТипТовар Тогда
			СтрокаТаблицаПремия.СуммаПродажТоваров = Строка.Сумма;
			СтрокаТаблицаПремия.НачисленоЗаПродажуТоваров = Строка.Сумма * ПроцентПремииЗаПродажуТоваров / 100;
			СтрокаТаблицаПремия.Премия = Строка.Сумма * ПроцентПремииЗаПродажуТоваров / 100;
		КонецЕсли;
		Если Строка.Номенклатура.ТипНоменклатуры = ТипУслуга Тогда
			СтрокаТаблицаПремия.СуммаПродажУслуг = Строка.Сумма;
			СтрокаТаблицаПремия.НачисленоЗаПродажуУслуг = Строка.Сумма * ПроцентПремииЗаПродажуУслуг / 100;
			СтрокаТаблицаПремия.Премия = Строка.Сумма * ПроцентПремииЗаПродажуУслуг / 100;
		КонецЕсли;
	КонецЦикла;
	
	Свернутая = ТаблицаПремии.Выгрузить();
	Свернутая.Свернуть("Сотрудник", "СуммаПродажТоваров, СуммаПродажУслуг, НачисленоЗаПродажуТоваров, НачисленоЗаПродажуУслуг, Премия");
	ТаблицаПремии.Загрузить(Свернутая);
		
КонецПроцедуры
